namespace FiniteDifferences
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
             Написать программу:
             На основании свойств конечных разностей найти значение полинома третьей степени P(x) в точке x=10(x=i, i=1,...,10), при условии, что сам полином не известен, а известны только первые 4 значения P(0)=1,P(1)=3,P(2)=7,P(3)=19. 
             + Реализовать в общем случае, когда степень полинома и значения x и P(x) вводятся с клавиатуры
             */

        }
    }
}
